Ran Plan for project: `terraform-root` dir: `terraform` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place

Terraform will perform the following actions:

  # helm_release.argocd will be updated in-place
~ resource "helm_release" "argocd" {
      ~ id                         = "argocd" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "v3.0.11" -> (known after apply)
          ~ chart          = "argo-cd" -> (known after apply)
          ~ first_deployed = 1758825015 -> (known after apply)
          ~ last_deployed  = 1759269143 -> (known after apply)
          ~ name           = "argocd" -> (known after apply)
          ~ namespace      = "argocd" -> (known after apply)
          ~ notes          = <<-EOT
                In order to access the server UI you have the following options:
                
                1. kubectl port-forward service/argocd-server -n argocd 8080:443
                
                    and then open the browser on http://localhost:8080 and accept the certificate
                
                2. enable ingress in the values file `server.ingress.enabled` and either
                      - Add the annotation for ssl passthrough: https://argo-cd.readthedocs.io/en/stable/operator-manual/ingress/#option-1-ssl-passthrough
                      - Set the `configs.params."server.insecure"` in the values file and terminate SSL at your ingress: https://argo-cd.readthedocs.io/en/stable/operator-manual/ingress/#option-2-multiple-ingress-objects-and-hosts
                
                
                After reaching the UI the first time you can login with username: admin and the random password generated during the installation. You can find the password by running:
                
                kubectl -n argocd get secret argocd-initial-admin-secret -o jsonpath="{.data.password}" | base64 -d
                
                (You should delete the initial secret afterwards as suggested by the Getting Started Guide: https://argo-cd.readthedocs.io/en/stable/getting_started/#4-login-using-the-cli)
            EOT -> (known after apply)
          ~ revision       = 12 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - applicationSet = {
                      - enabled = true
                      - ingress = {
                          - annotations      = {
                              - "alb.ingress.kubernetes.io/certificate-arn" = "arn:aws:acm:us-east-2:833565098889:certificate/02ef0c72-00b0-44b6-b075-e1a61423ad87"
                              - "alb.ingress.kubernetes.io/group.name"      = "desafio-acs"
                              - "alb.ingress.kubernetes.io/listen-ports"    = jsonencode(
                                    [
                                      - {
                                          - HTTP = 80
                                        },
                                      - {
                                          - HTTPS = 443
                                        },
                                    ]
                                )
                              - "alb.ingress.kubernetes.io/scheme"          = "internet-facing"
                              - "alb.ingress.kubernetes.io/ssl-redirect"    = "443"
                              - "alb.ingress.kubernetes.io/target-type"     = "ip"
                            }
                          - enabled          = true
                          - hostname         = "applicationset.thesams.site"
                          - ingressClassName = "alb"
                          - path             = "/"
                          - pathType         = "Prefix"
                        }
                      - metrics = {
                          - enabled = true
                        }
                    }
                  - configs        = {
                      - cm     = {
                          - "dex.config" = <<-EOT
                                connectors:
                                - type: github
                                  id: github
                                  name: GitHub
                                  config:
                                    clientID: "Ov23litldyrffxmawCCE"
                                    clientSecret: "19c5da8ddc9b3d73192a806c3b214c8062c7b4f2"
                                    orgs:
                                    - name: desafio-acs
                            EOT
                          - url          = "https://argocd.thesams.site"
                        }
                      - params = {
                          - "dexserver.disable.tls"        = true
                          - "server.dex.server"            = "http://argocd-dex-server:5556"
                          - "server.dex.server.strict.tls" = false
                          - "server.insecure"              = true
                        }
                      - rbac   = {
                          - "policy.csv"     = <<-EOT
                                # Role org-admin (admin full)
                                p, role:org-admin, applications, *, */*, allow
                                p, role:org-admin, clusters, get, *, allow
                                p, role:org-admin, repositories, *, *, allow
                                p, role:org-admin, logs, get, *, allow
                                p, role:org-admin, exec, create, */*, allow
                                g, desafio-acs:Admin, role:org-admin
                                
                                # Role readonly (visualização)
                                p, role:readonly, applications, get, */*, allow
                                p, role:readonly, applications, sync, */*, deny
                                p, role:readonly, clusters, get, *, allow
                                p, role:readonly, repositories, get, *, allow
                                p, role:readonly, logs, get, *, allow
                                p, role:readonly, exec, create, */*, deny
                                g, desafio-acs:ReadoOnly, role:readonly
                            EOT
                          - "policy.default" = "role:readonly"
                          - scopes           = "[groups]"
                        }
                    }
                  - controller     = {
                      - metrics = {
                          - enabled        = true
                          - rules          = {
                              - additionalLabels = {
                                  - release = "prometheus"
                                }
                              - enabled          = true
                              - namespace        = "monitoring"
                              - spec             = [
                                  - {
                                      - alert       = "ArgoAppMissing"
                                      - annotations = {
                                          - description = <<-EOT
                                                Argo CD has not reported any applications data for the past 15 minutes which means that it must be down or not functioning properly.  This needs to be resolved for this cloud to continue to maintain state.
                                            EOT
                                          - summary     = "[Argo CD] No reported applications"
                                        }
                                      - expr        = <<-EOT
                                            absent(argocd_app_info) == 1
                                        EOT
                                      - for         = "15m"
                                      - labels      = {
                                          - severity = "critical"
                                        }
                                    },
                                  - {
                                      - alert       = "ArgoAppNotSynced"
                                      - annotations = {
                                          - description = <<-EOT
                                                The application [{{`{{$labels.name}}`}} has not been synchronized for over 12 hours which means that the state of this cloud has drifted away from the state inside Git.
                                            EOT
                                          - summary     = "[{{`{{$labels.name}}`}}] Application not synchronized"
                                        }
                                      - expr        = <<-EOT
                                            argocd_app_info{sync_status!="Synced"} == 1
                                        EOT
                                      - for         = "12h"
                                      - labels      = {
                                          - severity = "warning"
                                        }
                                    },
                                ]
                            }
                          - serviceMonitor = {
                              - additionalLabels = {
                                  - release = "prometheus"
                                }
                              - enabled          = true
                              - namespace        = "monitoring"
                            }
                        }
                    }
                  - dex            = {
                      - enabled = true
                    }
                  - nameOverride   = "argocd"
                  - repoServer     = {
                      - metrics = {
                          - enabled        = true
                          - serviceMonitor = {
                              - additionalLabels = {
                                  - release = "prometheus"
                                }
                              - enabled          = true
                              - namespace        = "monitoring"
                            }
                        }
                    }
                  - server         = {
                      - ingress = {
                          - annotations      = {
                              - "alb.ingress.kubernetes.io/certificate-arn" = "arn:aws:acm:us-east-2:833565098889:certificate/02ef0c72-00b0-44b6-b075-e1a61423ad87"
                              - "alb.ingress.kubernetes.io/group.name"      = "desafio-acs"
                              - "alb.ingress.kubernetes.io/listen-ports"    = jsonencode(
                                    [
                                      - {
                                          - HTTP = 80
                                        },
                                      - {
                                          - HTTPS = 443
                                        },
                                    ]
                                )
                              - "alb.ingress.kubernetes.io/scheme"          = "internet-facing"
                              - "alb.ingress.kubernetes.io/ssl-redirect"    = "443"
                              - "alb.ingress.kubernetes.io/target-type"     = "ip"
                            }
                          - enabled          = true
                          - hostname         = "argocd.thesams.site"
                          - ingressClassName = "alb"
                          - path             = "/"
                          - pathType         = "Prefix"
                        }
                      - metrics = {
                          - enabled        = false
                          - serviceMonitor = {
                              - additionalLabels = {
                                  - release = "monitoring"
                                }
                              - enabled          = false
                              - namespace        = "monitoring"
                            }
                        }
                    }
                }
            ) -> (known after apply)
          ~ version        = "8.2.0" -> (known after apply)
        } -> (known after apply)
        name                       = "argocd"
      ~ values                     = [
          ~ <<-EOT
                nameOverride: argocd
                
                server:
                  ingress:
                    enabled: true
                    ingressClassName: alb
                    annotations:
                      alb.ingress.kubernetes.io/scheme: internet-facing
                      alb.ingress.kubernetes.io/listen-ports: '[{"HTTP":80},{"HTTPS":443}]'
                      alb.ingress.kubernetes.io/certificate-arn: arn:aws:acm:us-east-2:833565098889:certificate/02ef0c72-00b0-44b6-b075-e1a61423ad87
                      alb.ingress.kubernetes.io/target-type: ip
                      alb.ingress.kubernetes.io/ssl-redirect: "443"
                      alb.ingress.kubernetes.io/group.name: desafio-acs
                    hostname: "argocd.thesams.site"
                    path: /
                    pathType: Prefix
                
                  metrics:
                    enabled: false
                    serviceMonitor:
                      enabled: false
                      namespace: monitoring
                      additionalLabels:
                        release: monitoring
                
                repoServer:
                  metrics:
                    enabled: true
                    serviceMonitor:
                      enabled: true
                      namespace: monitoring
                      additionalLabels:
                        release: prometheus
                
                dex:
                  enabled: true
                
                controller:
                  metrics:
                    enabled: true
                    serviceMonitor:
                      enabled: true
                      namespace: monitoring
                      additionalLabels:
                        release: prometheus
                    rules:
                      enabled: true
                      additionalLabels: 
                        release: prometheus
                      namespace: monitoring
                      spec:
                      - alert: ArgoAppMissing
                        expr: |
                          absent(argocd_app_info) == 1
                        for: 15m
                        labels:
                          severity: critical
                        annotations:
                          summary: "[Argo CD] No reported applications"
                          description: >
                            Argo CD has not reported any applications data for the past 15 minutes which
                            means that it must be down or not functioning properly.  This needs to be
                            resolved for this cloud to continue to maintain state.
                      - alert: ArgoAppNotSynced
                        expr: |
                          argocd_app_info{sync_status!="Synced"} == 1
                        for: 12h
                        labels:
                          severity: warning
                        annotations:
                          summary: "[{{`{{$labels.name}}`}}] Application not synchronized"
                          description: >
                            The application [{{`{{$labels.name}}`}} has not been synchronized for over
                            12 hours which means that the state of this cloud has drifted away from the
                            state inside Git.
                
                configs:
                  params:
                    server.insecure: true
                    server.dex.server: http://argocd-dex-server:5556
                    dexserver.disable.tls: true
                    server.dex.server.strict.tls: false
                  cm:
                    url: https://argocd.thesams.site
                    dex.config:  |
                      connectors:
                      - type: github
                        id: github
                        name: GitHub
                        config:
              -           clientID: "Ov23litldyrffxmawCCE"
              -           clientSecret: "19c5da8ddc9b3d73192a806c3b214c8062c7b4f2"
              +           clientID: ""
              +           clientSecret: ""
                          orgs:
                          - name: desafio-acs
              -   
              -   rbac:
              -     policy.default: role:readonly  # qualquer usuário não mapeado fica readonly
              -     policy.csv: |
              -       # Role org-admin (admin full)
              -       p, role:org-admin, applications, *, */*, allow
              -       p, role:org-admin, clusters, get, *, allow
              -       p, role:org-admin, repositories, *, *, allow
              -       p, role:org-admin, logs, get, *, allow
              -       p, role:org-admin, exec, create, */*, allow
              -       g, desafio-acs:Admin, role:org-admin
                
              -       # Role readonly (visualização)
              -       p, role:readonly, applications, get, */*, allow
              -       p, role:readonly, applications, sync, */*, deny
              -       p, role:readonly, clusters, get, *, allow
              -       p, role:readonly, repositories, get, *, allow
              -       p, role:readonly, logs, get, *, allow
              -       p, role:readonly, exec, create, */*, deny
              -       g, desafio-acs:ReadoOnly, role:readonly
              - 
              -     scopes: '[groups]'
              - 
                applicationSet:
                  enabled: true
                  metrics:
                    enabled: true
                  ingress:
                    enabled: true
                    ingressClassName: alb
                    annotations:
                      alb.ingress.kubernetes.io/scheme: internet-facing
                      alb.ingress.kubernetes.io/listen-ports: '[{"HTTP":80},{"HTTPS":443}]'
                      alb.ingress.kubernetes.io/certificate-arn: arn:aws:acm:us-east-2:833565098889:certificate/02ef0c72-00b0-44b6-b075-e1a61423ad87
                      alb.ingress.kubernetes.io/target-type: ip
                      alb.ingress.kubernetes.io/ssl-redirect: "443"
                      alb.ingress.kubernetes.io/group.name: desafio-acs
                    hostname: "applicationset.thesams.site"
                    path: /
                    pathType: Prefix
            EOT,
        ]
        # (27 unchanged attributes hidden)
    }

  # module.eks_admin_users.kubernetes_config_map_v1_data.aws_auth_update will be updated in-place
~ resource "kubernetes_config_map_v1_data" "aws_auth_update" {
      ~ data          = {
          ~ "mapUsers" = <<-EOT
                - - "groups":
                    - "system:masters"
                    "userarn": "arn:aws:iam::833565098889:user/desafio_aquarela_samuel"
                    "username": "desafio_aquarela_samuel"
                  - "groups":
                    - "system:masters"
                    "userarn": "arn:aws:iam::833565098889:user/desafio_aquarela_samuel"
                    "username": "desafio_aquarela_samuel"
                - "groups":
                  - "system:masters"
                  "userarn": "arn:aws:iam::833565098889:user/desafio_aquarela_samuel"
                  "username": "desafio_aquarela_samuel"
                - "groups":
                  - "system:masters"
                  "userarn": "arn:aws:iam::833565098889:user/desafio_aquarela_samuel"
                  "username": "desafio_aquarela_samuel"
                - "groups":
                  - "system:masters"
                  "userarn": "arn:aws:iam::833565098889:user/desafio_aquarela_samuel"
                  "username": "desafio_aquarela_samuel"
                - "groups":
                  - "system:masters"
                  "userarn": "arn:aws:iam::833565098889:user/desafio_aquarela_samuel"
                  "username": "desafio_aquarela_samuel"
                - "groups":
                  - "system:masters"
                  "userarn": "arn:aws:iam::833565098889:user/desafio_aquarela_samuel"
                  "username": "desafio_aquarela_samuel"
                - "groups":
                  - "system:masters"
                  "userarn": "arn:aws:iam::833565098889:user/desafio_aquarela_samuel"
                  "username": "desafio_aquarela_samuel"
                - "groups":
                  - "system:masters"
                  "userarn": "arn:aws:iam::833565098889:user/desafio_aquarela_samuel"
                  "username": "desafio_aquarela_samuel"
                - "groups":
                  - "system:masters"
                  "userarn": "arn:aws:iam::833565098889:user/desafio_aquarela_samuel"
                  "username": "desafio_aquarela_samuel"
              + - "groups":
              +   - "system:masters"
              +   "userarn": "arn:aws:iam::833565098889:user/desafio_aquarela_samuel"
              +   "username": "desafio_aquarela_samuel"
            EOT
        }
        id            = "kube-system/aws-auth"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks_managed_node_group.aws_eks_node_group.eks_managed_node_group will be updated in-place
~ resource "aws_eks_node_group" "eks_managed_node_group" {
        id                     = "desafio-aquarela-cluster:desafio-aquarela-nodegroup"
        tags                   = {
            "Name"        = "desafio-aquarela-nodegroup"
            "environment" = "dev"
            "terraform"   = "true"
        }
        # (17 unchanged attributes hidden)

      ~ scaling_config {
          ~ max_size     = 5 -> 4
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.

Warning: Deprecated attribute

  on modules/aws-load-balancer-controller/iam.tf line 11, in resource "aws_iam_role" "eks_controller_role":
  11:                 "Federated": "arn:aws:iam::${data.aws_caller_identity.current.account_id}:oidc-provider/oidc.eks.${data.aws_region.current.name}.amazonaws.com/id/${local.oidc}"

The attribute "name" is deprecated. Refer to the provider documentation for
details.

(and 13 more similar warnings elsewhere)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p terraform-root`
* :put_litter_in_its_place: To **delete** this plan click [here](http://ip-10-0-3-11.us-east-2.compute.internal:4141/lock?id=desafio-acs%252Feks-terraform%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p terraform-root`
</details>
Plan: 0 to add, 3 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
